DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_bsec3.c
// SPDX-License-Identifier: BSD-3-Clause
/*
 * Copyright (c) 2022, STMicroelectronics
 */

#include <assert.h>
#include <config.h>
#include <drivers/stm32_bsec.h>
#include <initcall.h>
#include <io.h>
#include <kernel/delay.h>
#include <kernel/dt.h>
#include <kernel/pm.h>
#include <kernel/boot.h>
#include <kernel/spinlock.h>
#include <limits.h>
#include <libfdt.h>
#include <mm/core_memprot.h>
#include <platform_config.h>
#include <pta_bsec.h>
#include <util.h>

/* BSEC REGISTER OFFSET (base relative) */
#define BSEC_FVR(i)			(U(0x000) + 4U * (i))
#define BSEC_SPLOCK(i)			(U(0x800) + 4U * (i))
#define BSEC_SWLOCK(i)			(U(0x840) + 4U * (i))
#define BSEC_SRLOCK(i)			(U(0x880) + 4U * (i))
#define BSEC_OTPVLDR(i)			(U(0x8C0) + 4U * (i))
#define BSEC_SFSR(i)			(U(0x940) + 4U * (i))
#define BSEC_OTPCR			U(0xC04)
#define BSEC_WDR			U(0xC08)
#define BSEC_LOCKR			U(0xE10)
#define BSEC_DENR			U(0xE20)
#define BSEC_SR				U(0xE40)
#define BSEC_OTPSR			U(0xE44)
#define BSEC_VERR			U(0xFF4)
#define BSEC_IPIDR			U(0xFF8)

/* BSEC_SR register fields */
#define BSEC_SR_BUSY			BIT(0)
#define BSEC_SR_HVALID			BIT(1)
#define BSEC_SR_STATE_MASK		GENMASK_32(31, 26)
#define BSEC_SR_STATE_SHIFT		26U
#define BSEC_SR_STATE_OPEN		U(0x16)
#define BSEC_SR_STATE_CLOSED		U(0x0D)

/* BSEC_OTPCR register fields */
#define BSEC_OTPCR_PROG			BIT(13)
#define BSEC_OTPCR_PPLOCK		BIT(14)

/* BSEC_OTPSR register fields */
#define BSEC_OTPSR_BUSY			BIT(0)
#define BSEC_OTPSR_INIT_DONE		BIT(1)
#define BSEC_OTPSR_HIDEUP		BIT(2)
#define BSEC_OTPSR_OTPNVIR		BIT(4)
#define BSEC_OTPSR_OTPERR		BIT(5)
#define BSEC_OTPSR_OTPSEC		BIT(6)
#define BSEC_OTPSR_PROGFAIL		BIT(16)
#define BSEC_OTPSR_DISTURBF		BIT(17)
#define BSEC_OTPSR_DEDF			BIT(18)
#define BSEC_OTPSR_SECF			BIT(19)
#define BSEC_OTPSR_PPLF			BIT(20)
#define BSEC_OTPSR_PPLMF		BIT(21)
#define BSEC_OTPSR_AMEF			BIT(22)

/* BSEC_LOCKR register fields */
#define BSEC_LOCKR_GWLOCK_MASK		BIT(0)
#define BSEC_LOCKR_GWLOCK_SHIFT		0U
#define BSEC_LOCKR_DENLOCK_MASK		BIT(1)
#define BSEC_LOCKR_DENLOCK_SHIFT	1U
#define BSEC_LOCKR_HKLOCK_MASK		BIT(2)
#define BSEC_LOCKR_HKLOCK_SHIFT		2U

/* BSEC_DENR register fields */
#define BSEC_DENR_DBGENA		BIT(1)
#define BSEC_DENR_NIDENA		BIT(2)
#define BSEC_DENR_DDBGEN		BIT(3)
#define BSEC_DENR_HDPEN			BIT(4)
#define BSEC_DENR_SPIDENA		BIT(5)
#define BSEC_DENR_SPNIDENA		BIT(6)
#define BSEC_DENR_DBGSWEN		BIT(7)
#define BSEC_DENR_DBGENM		BIT(8)
#define BSEC_DENR_NIDENM		BIT(9)
#define BSEC_DENR_SPIDENM		BIT(10)
#define BSEC_DENR_SPNIDENM		BIT(11)
#define BSEC_DENR_CFGSDIS		BIT(12)
#define BSEC_DENR_CP15SDIS_MASK		GENMASK_32(14, 13)
#define BSEC_DENR_CP15SDIS_SHIFT	13U
#define BSEC_DENR_ALL_MASK		GENMASK_32(14, 1)
#define BSEC_DENR_WRITE_CONF		U(0xDEB60000)

/* BSEC_SR register fields */
#define BSEC_SR_HVALID			BIT(1)
#define BSEC_SR_NVSTATES_MASK		GENMASK_32(31, 26)
#define BSEC_SR_NVSTATES_SHIFT		26U
#define BSEC_SR_NVSTATES_OPEN		U(0x16)
#define BSEC_SR_NVSTATES_CLOSED		U(0x0D)
#define BSEC_SR_NVSTATES_OTP_LOCKED	U(0x23)

/* BSEC_VERR register fields */
#define BSEC_VERR_MASK			GENMASK_32(7, 0)

/* 32 bit by OTP bank in each register */
#define BSEC_OTP_MASK			GENMASK_32(4, 0)
#define BSEC_OTP_BANK_SHIFT		5U

#define BSEC_IP_VERSION_1_0		U(0x10)
#define BSEC_IP_ID_3			U(0x100033)

#define MAX_NB_TRIES			3U

/* Timeout when polling on status */
#define BSEC_TIMEOUT_US			U(10000)

#define OTP_ACCESS_SIZE			12U

#define HIDEUP_ERROR	(LOCK_SHADOW_R | LOCK_SHADOW_W | LOCK_SHADOW_P |\
			 LOCK_ERROR)

/* OTP18 = BOOTROM_CONFIG_0-3: Security life-cycle word 2 */
#define OTP_SECURE_BOOT			18U
#define OTP_CLOSED_SECURE		GENMASK_32(3, 0)

/* OEM Keys are stored from OEM_KEY_FIRST_OTP to OTP bsec_dev.max_id (367) */
#define OEM_KEY_FIRST_OTP		360

struct nvmem_cell {
	char *name;
	uint32_t phandle;
	uint32_t otp_id;
	uint8_t bit_offset;
	size_t bit_len;
};

struct bsec_dev {
	struct io_pa_va base;
	unsigned int upper_base;
	unsigned int max_id;
	unsigned int lock;
	struct bsec_shadow *shadow;
	struct nvmem_cell *cells;
	size_t cell_count;
};

/* Magic use to indicated valid SHADOW = 'B' 'S' 'E' 'C' */
#define BSEC_MAGIC			0x42534543

struct bsec_shadow {
	uint32_t magic;
	uint32_t state;
	uint32_t value[OTP_MAX_SIZE];
	uint32_t status[OTP_MAX_SIZE];
};

/* Only 1 instance of BSEC is expected per platform */
static struct bsec_dev bsec_dev = {
	.lock = SPINLOCK_UNLOCK
};

static uint32_t bsec_lock(void)
{
	if (!bsec_dev.lock || !cpu_mmu_enabled())
		return 0;

	return cpu_spin_lock_xsave(&bsec_dev.lock);
}

static void bsec_unlock(uint32_t exceptions)
{
	if (!bsec_dev.lock || !cpu_mmu_enabled())
		return;

	cpu_spin_unlock_xrestore(&bsec_dev.lock, exceptions);
}

static vaddr_t bsec_base(void)
{
	return io_pa_or_va_secure(&bsec_dev.base, 1);
}

static uint32_t bsec_get_otp_status(void)
{
	return io_read32(bsec_base() + BSEC_OTPSR);
}

static TEE_Result bsec_poll_otp_status_busy(uint32_t *status)
{
	uint64_t timeout_ref = timeout_init_us(BSEC_TIMEOUT_US);

	while (!timeout_elapsed(timeout_ref))
		if (!(bsec_get_otp_status() & BSEC_OTPSR_BUSY))
			break;

	*status = bsec_get_otp_status();
	if (*status & BSEC_OTPSR_BUSY)
		return TEE_ERROR_BUSY;

	return TEE_SUCCESS;
}

/* get bank: id of U32 register associated to the OTP */
static uint32_t otp_bank(uint32_t otp)
{
	assert(otp <= bsec_dev.max_id);

	return ((otp & ~BSEC_OTP_MASK) >> BSEC_OTP_BANK_SHIFT);
}

/* get bit in the bank associated to the OTP */
static uint32_t otp_bit(uint32_t otp)
{
	return BIT(otp & BSEC_OTP_MASK);
}

static bool is_bsec_write_locked(void)
{
	return (io_read32(bsec_base() + BSEC_LOCKR) &
		BSEC_LOCKR_GWLOCK_MASK);
}

static TEE_Result shadow_otp(unsigned int otp)
{
	unsigned int i = 0U;
	TEE_Result result = TEE_ERROR_GENERIC;
	uint32_t status = 0U;

	/* if shadow is not allowed */
	if (bsec_dev.shadow->status[otp] & LOCK_SHADOW_R) {
		bsec_dev.shadow->status[otp] |= LOCK_ERROR;
		bsec_dev.shadow->value[otp] = 0x0U;

		return TEE_ERROR_GENERIC;
	}

	bsec_dev.shadow->status[otp] &= ~LOCK_ERROR;
	for (i = 0U; i < MAX_NB_TRIES; i++) {
		io_write32(bsec_base() + BSEC_OTPCR, otp);

		result = bsec_poll_otp_status_busy(&status);
		if (result)
			panic("BSEC busy timeout");
		/* Retry on error */
		if (status & (BSEC_OTPSR_AMEF | BSEC_OTPSR_DISTURBF |
			      BSEC_OTPSR_DEDF))
			continue;
		/* break for OTP correctly shadowed */
		break;
	}
	if (status & BSEC_OTPSR_PPLF)
		bsec_dev.shadow->status[otp] |= LOCK_PERM;
	if (i == MAX_NB_TRIES || status & (BSEC_OTPSR_PPLMF | BSEC_OTPSR_AMEF |
					   BSEC_OTPSR_DISTURBF |
					   BSEC_OTPSR_DEDF)) {
		bsec_dev.shadow->status[otp] |= LOCK_ERROR;
		return TEE_ERROR_GENERIC;
	}

	return TEE_SUCCESS;
}

static void check_reset_error(void)
{
	uint32_t status = bsec_get_otp_status();

	if (status & BSEC_OTPSR_OTPSEC)
		DMSG("BSEC reset single error correction detected");

	if ((status & BSEC_OTPSR_OTPNVIR) != BSEC_OTPSR_OTPNVIR)
		DMSG("BSEC virgin OTP word 0");

	if (status & BSEC_OTPSR_HIDEUP)
		DMSG("BSEC upper fuse not accessible");

	if (status & BSEC_OTPSR_OTPERR)
		panic("BSEC shadow error detected");

	if ((status & BSEC_OTPSR_INIT_DONE) != BSEC_OTPSR_INIT_DONE)
		panic("BSEC reset operations not completed");

	if (is_bsec_write_locked())
		panic("BSEC global write lock");
}

