DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_bsec3.c
static bool is_fuse_shadowed(uint32_t otp)
{
	uint32_t bank = otp_bank(otp);
	uint32_t mask = otp_bit(otp);
	uint32_t bank_value = 0U;

	bank_value = io_read32(bsec_base() + BSEC_SFSR(bank));

	if (bank_value & mask)
		return true;

	return false;
}

/*
 * bsec_read_otp: read an OTP data value.
 * val: read value.
 * otp: OTP number.
 * return value: TEE_SUCCESS if no error.
 */
TEE_Result stm32_bsec_read_otp(uint32_t *val, uint32_t otp)
{
	TEE_Result result = TEE_ERROR_GENERIC;

	assert(val);

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	/* for non-secure OTP: only return the shadow value */
	if (!(bsec_dev.shadow->status[otp] & STATUS_SECURE)) {
		*val = bsec_dev.shadow->value[otp];

		return TEE_SUCCESS;
	}

	/* for secure OTP, reload fuse word */
	*val = 0U;
	result = shadow_otp(otp);
	if (!result)
		*val = io_read32(bsec_base() + BSEC_FVR(otp));

	return result;
}

/*
 * bsec_shadow_read_otp: Load OTP from SAFMEM and provide its value
 * val: read value.
 * otp: OTP number.
 * return value: TEE_SUCCESS if no error.
 */
TEE_Result stm32_bsec_shadow_read_otp(uint32_t *val, uint32_t otp)
{
	TEE_Result result = TEE_SUCCESS;

	assert(val);

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	/* for non-secure OTP: only return the shadow value */
	if (!(bsec_dev.shadow->status[otp] & STATUS_SECURE)) {
		*val = bsec_dev.shadow->value[otp];

		return TEE_SUCCESS;
	}

	/* for secure OTP, reload fuse word if not shadowed */
	*val = 0U;
	if (!is_fuse_shadowed(otp))
		result = shadow_otp(otp);
	if (!result)
		*val = io_read32(bsec_base() + BSEC_FVR(otp));

	return result;
}

/*
 * bsec_write_otp: write value in BSEC data register.
 * val: value to write.
 * otp: OTP number.
 * return value: TEE_SUCCESS if no error.
 */
TEE_Result stm32_bsec_write_otp(uint32_t val, uint32_t otp)
{
	uint32_t exceptions = 0U;
	bool value = false;

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	if (is_bsec_write_locked())
		return TEE_ERROR_ACCESS_DENIED;

	/* for HW shadowed OTP, update value in FVR register */
	if (is_fuse_shadowed(otp)) {
		stm32_bsec_read_sw_lock(otp, &value);
		if (value) {
			DMSG("BSEC: OTP %"PRIu32" is locked, write ignored",
			     otp);
			return TEE_ERROR_ACCESS_DENIED;
		}

		exceptions = bsec_lock();

		io_write32(bsec_base() + BSEC_FVR(otp), val);

		bsec_unlock(exceptions);
	} else if ((bsec_dev.shadow->status[otp] & STATUS_SECURE)) {
		/* update of secure and not-shadowed OTP is not allowed */
		return TEE_ERROR_ACCESS_DENIED;
	}

	/* Update the shadow memory when it is allowed */
	if (!(bsec_dev.shadow->status[otp] & STATUS_SECURE)) {
		bsec_dev.shadow->value[otp] = val;
		bsec_dev.shadow->status[otp] &= ~LOCK_ERROR;
	}

	return TEE_SUCCESS;
}

#ifdef CFG_STM32_BSEC_WRITE
static TEE_Result check_program_error(uint32_t otp __maybe_unused,
				      uint32_t status __maybe_unused)
{
	if (status & BSEC_OTPSR_PROGFAIL) {
		EMSG("BSEC program %"PRIu32" error %#"PRIx32, otp, status);
		return TEE_ERROR_GENERIC;
	}

	return TEE_SUCCESS;
}

TEE_Result stm32_bsec_program_otp(uint32_t val, uint32_t otp)
{
	TEE_Result result = TEE_ERROR_GENERIC;
	unsigned int i = 0U;
	bool value = false;
	uint32_t exceptions = 0U;
	uint32_t fvr = 0U;

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	if (is_bsec_write_locked())
		return TEE_ERROR_ACCESS_DENIED;

	result = stm32_bsec_read_sp_lock(otp, &value);
	if (result) {
		EMSG("BSEC: %"PRIu32" Sticky-prog bit read Error %"PRIu32,
		     otp, result);
		return result;
	}

	if (value) {
		DMSG("BSEC: OTP locked, prog will be ignored");
		return TEE_ERROR_ACCESS_DENIED;
	}

	exceptions = bsec_lock();

	bsec_dev.shadow->value[otp] = 0x0U;
	bsec_dev.shadow->status[otp] |= LOCK_ERROR;

	for (i = 0U; i < MAX_NB_TRIES; i++) {
		uint32_t status = 0U;

		io_write32(bsec_base() + BSEC_WDR, val);
		io_write32(bsec_base() + BSEC_OTPCR, otp | BSEC_OTPCR_PROG);

		result = bsec_poll_otp_status_busy(&status);
		if (result)
			panic("BSEC busy timeout");

		result = check_program_error(otp, status);
		if (!result)
			break;
	}
	if (i == MAX_NB_TRIES) {
		result = TEE_ERROR_GENERIC;
		EMSG("BSEC program %"PRIu32" retry", otp);
	}

	/* update the shadow */
	if (!result) {
		stm32_bsec_read_sr_lock(otp, &value);
		/* if reload is locked: directly write in shadow register */
		if (value) {
			stm32_bsec_read_sw_lock(otp, &value);
			/*
			 * update value in FVR register for HW shadowed OTP
			 * if they are not shadow wrtite locked
			 */
			if (is_fuse_shadowed(otp) && !value) {
				io_write32(bsec_base() + BSEC_FVR(otp), val);
				fvr = io_read32(bsec_base() + BSEC_FVR(otp));
			} else {
				fvr = val;
			}
		} else {
			shadow_otp(otp); /* reload the fuse word */
			fvr = io_read32(bsec_base() + BSEC_FVR(otp));
		}
		if (fvr != val)
			EMSG("BSEC shadow %"PRIu32" invalid: %08x, write= %08x",
			     otp, fvr, val);

		/* update the shadow memory if allowed */
		if (!(bsec_dev.shadow->status[otp] & STATUS_SECURE)) {
			bsec_dev.shadow->value[otp] = fvr;
			bsec_dev.shadow->status[otp] &= ~LOCK_ERROR;
		}
	}

	bsec_unlock(exceptions);

	return result;
}
#endif

TEE_Result stm32_bsec_write_debug_conf(uint32_t val)
{
	TEE_Result result = TEE_ERROR_GENERIC;
	uint32_t exceptions = 0U;

	if (is_bsec_write_locked())
		return TEE_ERROR_ACCESS_DENIED;

	exceptions = bsec_lock();

	io_clrsetbits32(bsec_base() + BSEC_DENR, BSEC_DENR_ALL_MASK,
			val | BSEC_DENR_WRITE_CONF);


	if (stm32_bsec_read_debug_conf() == val)
		result = TEE_SUCCESS;

	bsec_unlock(exceptions);

	return result;
}

uint32_t stm32_bsec_read_debug_conf(void)
{
	return io_read32(bsec_base() + BSEC_DENR) & BSEC_DENR_ALL_MASK;
}

bool stm32_bsec_self_hosted_debug_is_enabled(void)
{
	return stm32_bsec_read_debug_conf() & BSEC_DENR_DBGSWEN;
}

/*
 * bsec_get_version: return BSEC version.
 */
static uint32_t bsec_get_version(void)
{
	return io_read32(bsec_base() + BSEC_VERR) & BSEC_VERR_MASK;
}

/*
 * bsec_get_id: return BSEC ID.
 */
static uint32_t bsec_get_id(void)
{
	return io_read32(bsec_base() + BSEC_IPIDR);
}

