DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_bsec3.c
/*
 * bsec_set_sr_lock: set shadow-read lock.
 * otp: OTP number.
 * return value: TEE_SUCCESS if no error.
 */
TEE_Result stm32_bsec_set_sr_lock(uint32_t otp)
{
	TEE_Result result = TEE_ERROR_GENERIC;
	uint32_t bank = otp_bank(otp);
	uint32_t bank_value = 0U;
	uint32_t mask = otp_bit(otp);
	uint32_t exceptions = 0U;

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	if (is_bsec_write_locked())
		return TEE_ERROR_ACCESS_DENIED;

	exceptions = bsec_lock();

	bank_value = io_read32(bsec_base() + BSEC_SRLOCK(bank));

	if (bank_value & mask) {
		/* The lock is already set */
		result = TEE_SUCCESS;
	} else {
		bank_value = bank_value | mask;

		/*
		 * We can write 0 in all other OTP bits with no effect,
		 * even if the lock is activated.
		 */
		io_write32(bsec_base() + BSEC_SRLOCK(bank), bank_value);
		bsec_dev.shadow->status[otp] |= LOCK_SHADOW_R;
		result = TEE_SUCCESS;
	}

	bsec_unlock(exceptions);

	return result;
}

TEE_Result stm32_bsec_read_sr_lock(uint32_t otp, bool *value)
{
	assert(value);

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	*value = bsec_dev.shadow->status[otp] & LOCK_SHADOW_R;

	return TEE_SUCCESS;
}

/*
 * bsec_set_sw_lock: set shadow-write lock.
 * otp: OTP number.
 * return value: TEE_SUCCESS if no error.
 */
TEE_Result stm32_bsec_set_sw_lock(uint32_t otp)
{
	TEE_Result result = TEE_ERROR_GENERIC;
	uint32_t bank = otp_bank(otp);
	uint32_t mask = otp_bit(otp);
	uint32_t bank_value = 0U;
	uint32_t exceptions = 0U;

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	if (is_bsec_write_locked())
		return TEE_ERROR_ACCESS_DENIED;

	exceptions = bsec_lock();

	bank_value = io_read32(bsec_base() + BSEC_SWLOCK(bank));

	if (bank_value & mask) {
		/* The lock is already set */
		result = TEE_SUCCESS;
	} else {
		bank_value = bank_value | mask;

		/*
		 * We can write 0 in all other OTP bits with no effect,
		 * even if the lock is activated.
		 */
		io_write32(bsec_base() + BSEC_SWLOCK(bank), bank_value);
		bsec_dev.shadow->status[otp] |= LOCK_SHADOW_W;
		result = TEE_SUCCESS;
	}

	bsec_unlock(exceptions);

	return result;
}

TEE_Result stm32_bsec_read_sw_lock(uint32_t otp, bool *value)
{
	assert(value);

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	*value = bsec_dev.shadow->status[otp] & LOCK_SHADOW_W;

	/*
	 * OEM keys are accessible only in ROM code
	 * They are stored in last OTPs
	 */
	if (otp >= OEM_KEY_FIRST_OTP)
		*value = LOCK_SHADOW_W;

	return TEE_SUCCESS;
}

TEE_Result stm32_bsec_set_sp_lock(uint32_t otp)
{
	TEE_Result result = TEE_ERROR_GENERIC;
	uint32_t bank = otp_bank(otp);
	uint32_t bank_value = 0U;
	uint32_t mask = otp_bit(otp);
	uint32_t exceptions = 0U;

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	if (is_bsec_write_locked())
		return TEE_ERROR_ACCESS_DENIED;

	exceptions = bsec_lock();

	bank_value = io_read32(bsec_base() + BSEC_SPLOCK(bank));

	if (bank_value & mask) {
		/* The lock is already set */
		result = TEE_SUCCESS;
	} else {
		bank_value = bank_value | mask;

		/*
		 * We can write 0 in all other OTP bits with no effect,
		 * even if the lock is activated.
		 */
		io_write32(bsec_base() + BSEC_SPLOCK(bank), bank_value);
		bsec_dev.shadow->status[otp] |= LOCK_SHADOW_P;
		result = TEE_SUCCESS;
	}

	bsec_unlock(exceptions);

	return result;
}

TEE_Result stm32_bsec_read_sp_lock(uint32_t otp, bool *value)
{
	assert(value);

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	*value = bsec_dev.shadow->status[otp] & LOCK_SHADOW_P;

	return TEE_SUCCESS;
}

#ifdef CFG_STM32_BSEC_WRITE
TEE_Result stm32_bsec_permanent_lock_otp(uint32_t otp)
{
	TEE_Result result = TEE_ERROR_GENERIC;
	unsigned int i = 0U;
	uint32_t exceptions = 0U;

	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	if (is_bsec_write_locked())
		return TEE_ERROR_ACCESS_DENIED;

	exceptions = bsec_lock();

	io_write32(bsec_base() + BSEC_WDR, 0U);

	for (i = 0U; i < MAX_NB_TRIES; i++) {
		uint32_t status = 0U;

		io_write32(bsec_base() + BSEC_OTPCR,
			   otp | BSEC_OTPCR_PPLOCK | BSEC_OTPCR_PROG);

		result = bsec_poll_otp_status_busy(&status);
		if (result)
			panic("BSEC busy timeout");

		result = check_program_error(otp, status);
		if (!result)
			break;
	}
	if (i == MAX_NB_TRIES) {
		result = TEE_ERROR_GENERIC;
		EMSG("BSEC program %"PRIu32" retry", otp);
	}

	if (!result)
		bsec_dev.shadow->status[otp] |= LOCK_PERM;

	bsec_unlock(exceptions);

	return result;
}
#endif

TEE_Result stm32_bsec_read_permanent_lock(uint32_t otp, bool *value)
{
	assert(value);
	if (otp > bsec_dev.max_id)
		return TEE_ERROR_BAD_PARAMETERS;

	*value = bsec_dev.shadow->status[otp] & LOCK_PERM;

	return TEE_SUCCESS;
}

bool stm32_bsec_can_access_otp(uint32_t otp)
{
	if (bsec_dev.shadow->magic != BSEC_MAGIC)
		return false;

	if (bsec_dev.shadow->state == BSEC_STATE_INVALID)
		return false;

	if (otp < bsec_dev.upper_base)
		return true;

	/* manage HIDEUP */
	if ((bsec_dev.shadow->status[otp] & HIDEUP_ERROR) == HIDEUP_ERROR)
		return false;

	if (otp > bsec_dev.max_id)
		return false;

	return true;
}

bool stm32_bsec_nsec_can_access_otp(uint32_t otp)
{
	if (bsec_dev.shadow->magic != BSEC_MAGIC)
		return false;

	if (bsec_dev.shadow->state == BSEC_STATE_INVALID)
		return false;

	/* lower OTP are accessible by non secure */
	if (otp < bsec_dev.upper_base)
		return true;

	if (otp > bsec_dev.max_id)
		return false;

	/* manage HIDEUP */
	if ((bsec_dev.shadow->status[otp] & HIDEUP_ERROR) == HIDEUP_ERROR)
		return false;

	/* upper OTP with provisioning tag and not locked are accessible */
	if ((bsec_dev.shadow->status[otp] & STATUS_PROVISIONING) ==
	     STATUS_PROVISIONING &&
	    (bsec_dev.shadow->status[otp] & LOCK_PERM) != LOCK_PERM)
		return true;

	return false;
}

TEE_Result stm32_bsec_get_state(uint32_t *state)
{
	assert(state);

	if (bsec_dev.shadow->magic == BSEC_MAGIC)
		*state = bsec_dev.shadow->state;
	else
		*state = BSEC_STATE_INVALID;

	return TEE_SUCCESS;
}

static uint32_t init_state(uint32_t status)
{
	uint32_t bsec_sr = 0U, nvstates = 0U, state = 0U;

	bsec_sr = io_read32(bsec_base() + BSEC_SR);

	state = BSEC_STATE_INVALID;
	if (status & BSEC_OTPSR_INIT_DONE) {
		/* NVSTATES is only valid if INIT_DONE = 1 */
		nvstates = (bsec_sr & BSEC_SR_NVSTATES_MASK) >>
			   BSEC_SR_NVSTATES_SHIFT;

		/* Only 1 supported state = CLOSED */
		if (nvstates != BSEC_SR_NVSTATES_CLOSED) {
			state = BSEC_STATE_INVALID;
			EMSG("BSEC invalid nvstates %#x\n", nvstates);
		} else {
			state = BSEC_STATE_SEC_OPEN;
			if (bsec_dev.shadow->value[OTP_SECURE_BOOT] &
			    OTP_CLOSED_SECURE)
				state = BSEC_STATE_SEC_CLOSED;
		}
	}

	return state;
}

