DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_bsec3.c
static void stm32_bsec_shadow_load(uint32_t status)
{
	unsigned int otp = 0U, bank = 0U;
	uint32_t exceptions = 0U;
	uint32_t srlock[OTP_ACCESS_SIZE] = { 0U };
	uint32_t swlock[OTP_ACCESS_SIZE] = { 0U };
	uint32_t splock[OTP_ACCESS_SIZE] = { 0U };
	uint32_t sfsr[OTP_ACCESS_SIZE] = { 0U };
	uint32_t otpvldr[OTP_ACCESS_SIZE] = { 0U };
	uint32_t mask = 0U;
	unsigned int max_id = bsec_dev.max_id;

	memset(bsec_dev.shadow, 0, sizeof(*bsec_dev.shadow));
	bsec_dev.shadow->magic = BSEC_MAGIC;
	bsec_dev.shadow->state = BSEC_STATE_INVALID;

	exceptions = bsec_lock();

	/* HIDEUP: read and write not possible in upper region */
	if (status & BSEC_OTPSR_HIDEUP) {
		for (otp = bsec_dev.upper_base;
		     otp <= bsec_dev.max_id ; otp++) {
			bsec_dev.shadow->status[otp] |= HIDEUP_ERROR;
			bsec_dev.shadow->value[otp] = 0x0U;
		}
		max_id = bsec_dev.upper_base - 1;
	}

	for (bank = 0U; bank < OTP_ACCESS_SIZE; bank++) {
		srlock[bank] = io_read32(bsec_base() + BSEC_SRLOCK(bank));
		swlock[bank] = io_read32(bsec_base() + BSEC_SWLOCK(bank));
		splock[bank] = io_read32(bsec_base() + BSEC_SPLOCK(bank));
		sfsr[bank] = io_read32(bsec_base() + BSEC_SFSR(bank));
		otpvldr[bank] = io_read32(bsec_base() + BSEC_OTPVLDR(bank));
	}

	for (otp = 0U; otp <= max_id ; otp++) {
		bank = otp_bank(otp);
		mask = otp_bit(otp);

		if (srlock[bank] & mask)
			bsec_dev.shadow->status[otp] |= LOCK_SHADOW_R;
		if (swlock[bank] & mask)
			bsec_dev.shadow->status[otp] |= LOCK_SHADOW_W;
		if (splock[bank] & mask)
			bsec_dev.shadow->status[otp] |= LOCK_SHADOW_P;

		if (bsec_dev.shadow->status[otp] & STATUS_SECURE)
			continue;

		/*
		 * OEM keys are accessible only in ROM code
		 * They are stored in last OTPs
		 */
		if (otp >= OEM_KEY_FIRST_OTP) {
			bsec_dev.shadow->status[otp] |= LOCK_SHADOW_R;
			continue;
		}

		/* request shadow if not yet done or not valid */
		if (!(sfsr[bank] & mask) || !(otpvldr[bank] & mask))
			shadow_otp(otp);

		bsec_dev.shadow->value[otp] = io_read32(bsec_base() +
					      BSEC_FVR(otp));
	}

	bsec_unlock(exceptions);
}

static void stm32_bsec_shadow_init(bool force_load)
{
	uint32_t status = bsec_get_otp_status();

	/* update shadow when forced or invalid */
	if (force_load || bsec_dev.shadow->magic != BSEC_MAGIC)
		stm32_bsec_shadow_load(status);

	/* always update status */
	bsec_dev.shadow->state = init_state(status);
	if ((bsec_dev.shadow->state & BSEC_STATE_MASK) == BSEC_STATE_INVALID)
		panic("BSEC invalid state");
}

TEE_Result stm32_bsec_find_otp_in_nvmem_layout(const char *name,
					       uint32_t *otp_id,
					       uint8_t *otp_bit_offset,
					       size_t *otp_bit_len)
{
	size_t i = 0U;

	if (!name)
		return TEE_ERROR_BAD_PARAMETERS;

	for (i = 0U; i < bsec_dev.cell_count; i++) {
		if (!bsec_dev.cells[i].name ||
		    strcmp(name, bsec_dev.cells[i].name))
			continue;

		if (otp_id)
			*otp_id = bsec_dev.cells[i].otp_id;

		if (otp_bit_offset)
			*otp_bit_offset = bsec_dev.cells[i].bit_offset;

		if (otp_bit_len)
			*otp_bit_len = bsec_dev.cells[i].bit_len;

		DMSG("nvmem %s = %zu: %"PRIu32" bit offset: %u, length: %zu",
		     name, i, bsec_dev.cells[i].otp_id,
		     bsec_dev.cells[i].bit_offset, bsec_dev.cells[i].bit_len);

		return TEE_SUCCESS;
	}

	return TEE_ERROR_ITEM_NOT_FOUND;
}

TEE_Result stm32_bsec_find_otp_by_phandle(const uint32_t phandle,
					  uint32_t *otp_id,
					  uint8_t *otp_bit_offset,
					  size_t *otp_bit_len)
{
	size_t i = 0;

	if (!phandle)
		return TEE_ERROR_GENERIC;

	for (i = 0U; i < bsec_dev.cell_count; i++) {
		if (bsec_dev.cells[i].phandle != phandle)
			continue;

		if (otp_id)
			*otp_id = bsec_dev.cells[i].otp_id;

		if (otp_bit_offset)
			*otp_bit_offset = bsec_dev.cells[i].bit_offset;

		if (otp_bit_len)
			*otp_bit_len = bsec_dev.cells[i].bit_len;

		DMSG("nvmem %"PRIu32" = %zu: %"PRIu32" bit offset: %u, length: %zu",
		     phandle, i, bsec_dev.cells[i].otp_id,
		     bsec_dev.cells[i].bit_offset, bsec_dev.cells[i].bit_len);

		return TEE_SUCCESS;
	}

	return TEE_ERROR_ITEM_NOT_FOUND;
}

static void initialize_nvmem_layout_from_dt(void *fdt, int bsec_node)
{
	int cell_max = 0;
	int cell_cnt = 0;
	int node = 0;
	unsigned int otp = 0U, otp_nb = 0U;

	fdt_for_each_subnode(node, fdt, bsec_node)
		cell_max++;
	if (!cell_max)
		return;

	bsec_dev.cells = calloc(cell_max, sizeof(struct nvmem_cell));
	if (!bsec_dev.cells)
		panic("Could not create nvmem layout");

	fdt_for_each_subnode(node, fdt, bsec_node) {
		paddr_t reg_offset = 0;
		size_t reg_length = 0;
		const char *name = NULL;
		const char *s = NULL;
		int len = 0;
		struct nvmem_cell *cell = &bsec_dev.cells[cell_cnt];
		uint32_t bits[2] = { };

		name = fdt_get_name(fdt, node, &len);
		if (!name || !len)
			continue;

		cell->phandle = fdt_get_phandle(fdt, node);

		reg_offset = _fdt_reg_base_address(fdt, node);
		reg_length = _fdt_reg_size(fdt, node);

		if (reg_offset == DT_INFO_INVALID_REG ||
		    reg_length == DT_INFO_INVALID_REG_SIZE) {
			IMSG("Malformed nvmem %s: ignored", name);
			continue;
		}

		cell->otp_id = reg_offset / sizeof(uint32_t);
		assert(cell->otp_id <= bsec_dev.max_id);
		cell->bit_offset = (reg_offset % sizeof(uint32_t)) * CHAR_BIT;
		otp_nb = reg_length / sizeof(uint32_t);
		cell->bit_len = otp_nb * sizeof(uint32_t) * CHAR_BIT;

		if (!_fdt_read_uint32_array(fdt, node, "bits", bits, 2)) {
			assert(bits[0] <= 7 && bits[1] >= 1);
			cell->bit_offset += bits[0];
			cell->bit_len = (size_t)bits[1];
		}

		s = strchr(name, '@');
		if (s)
			len = s - name;

		cell->name = strndup(name, len);
		if (!cell->name)
			panic();

		cell_cnt++;
		DMSG("nvmem[%d] = %s %"PRIu32"bit offset: %u, length: %zu",
		     cell_cnt, cell->name, cell->otp_id,
		     cell->bit_offset, cell->bit_len);

		/* check if shadowing is not allowed */
		if (fdt_getprop(fdt, node, "st,secure-otp", NULL)) {
			for (otp = cell->otp_id;
			     otp < cell->otp_id + otp_nb; otp++)
				bsec_dev.shadow->status[otp] |= STATUS_SECURE;
		}
		/* check if provisioning is allowed */
		else if (fdt_getprop(fdt, node,
				     "st,non-secure-otp-provisioning", NULL)) {
			for (otp = cell->otp_id;
			     otp < cell->otp_id + otp_nb; otp++)
				bsec_dev.shadow->status[otp] |=
					STATUS_PROVISIONING;
		}
	}

	if (cell_cnt != cell_max) {
		bsec_dev.cells = realloc(bsec_dev.cells,
					 cell_cnt * sizeof(struct nvmem_cell));
		if (!bsec_dev.cells)
			panic();
	}

	bsec_dev.cell_count = cell_cnt;
}

static void initialize_bsec_from_dt(void *fdt, int node)
{
	struct dt_node_info bsec_info = { };

	_fdt_fill_device_info(fdt, &bsec_info, node);

	if (bsec_info.reg != bsec_dev.base.pa ||
	    !(bsec_info.status & DT_STATUS_OK_SEC))
		panic();
}

static TEE_Result
stm32_bsec_pm(enum pm_op op, unsigned int pm_hint,
	      const struct pm_callback_handle *pm_handle __unused)
{
	if (!PM_HINT_IS_STATE(pm_hint, CONTEXT))
		return TEE_SUCCESS;

	if (op == PM_OP_RESUME) {
		/* treat BSEC error */
		check_reset_error();

		/* re initialize the shadow */
		stm32_bsec_shadow_init(false);
	}

	return TEE_SUCCESS;
}

static TEE_Result initialize_bsec(void)
{
	struct stm32_bsec_static_cfg cfg = { };
	void *fdt = NULL;
	vaddr_t va = 0;
	int node = 0;

	plat_bsec_get_static_cfg(&cfg);

	va = core_mmu_get_va(cfg.shadow, MEM_AREA_RAM_SEC, SIZE_4K);
	if (!va)
		return TEE_ERROR_GENERIC;

	bsec_dev.base.pa = cfg.base;
	bsec_dev.shadow = (struct bsec_shadow *)va;
	bsec_dev.upper_base = cfg.upper_start;
	bsec_dev.max_id = cfg.max_id;

	fdt = get_embedded_dt();
	node = fdt_node_offset_by_compatible(fdt, 0, "st,stm32mp25-bsec");
	if (node < 0)
		panic();

	initialize_bsec_from_dt(fdt, node);

	if ((bsec_get_version() != BSEC_IP_VERSION_1_0) ||
	    (bsec_get_id() != BSEC_IP_ID_3))
		panic("BSEC probe wrong IP version/ID\n");

	check_reset_error();

	/* initialize the shadow */
	stm32_bsec_shadow_init(true);

	initialize_nvmem_layout_from_dt(fdt, node);

	if (IS_ENABLED(CFG_PM))
		register_pm_core_service_cb(stm32_bsec_pm, NULL, "stm32-bsec");

	return TEE_SUCCESS;
}

early_init(initialize_bsec);
